#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ElettroAle/shared-infrastructure/runs/run-afJCh1nMzWMwqQVo

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster]
module.cluster.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.ContainerRegistry/registries/crclusterprod]
azurerm_dns_zone.zone: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.Network/dnsZones/elettroale.com]
module.cluster.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.ContainerService/managedClusters/aks-cluster-prod]
module.cluster.azurerm_role_assignment.rbac: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.ContainerRegistry/registries/crclusterprod/providers/Microsoft.Authorization/roleAssignments/2f21be19-eaaa-e73c-6fc2-c0f589a9673b]
module.cluster.azurerm_public_ip.lb-public-ip: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.Network/publicIPAddresses/pip-cluster-prod]
azurerm_dns_a_record.a_record: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.Network/dnsZones/elettroale.com/A/elettroale.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_dns_a_record.a_record will be updated in-place
  ~ resource "azurerm_dns_a_record" "a_record" {
        id                  = "/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.Network/dnsZones/elettroale.com/A/elettroale.com"
        name                = "elettroale.com"
      ~ records             = [
          - "20.73.229.161",
        ] -> (known after apply)
        tags                = {}
        # (4 unchanged attributes hidden)
    }

  # module.cluster.azurerm_public_ip.lb-public-ip must be replaced
-/+ resource "azurerm_public_ip" "lb-public-ip" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.Network/publicIPAddresses/pip-cluster-prod" -> (known after apply)
      ~ ip_address              = "51.124.221.158" -> (known after apply)
      - ip_tags                 = {} -> null
        name                    = "pip-cluster-prod"
      ~ resource_group_name     = "rg-cluster" -> "MC_rg-cluster_aks-cluster-prod_westeurope" # forces replacement
      - tags                    = {} -> null
      - zones                   = [] -> null
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  + cluster_ip = (known after apply)
  - ip         = {
      - allocation_method       = "Static"
      - ddos_protection_mode    = "VirtualNetworkInherited"
      - ddos_protection_plan_id = null
      - domain_name_label       = null
      - edge_zone               = ""
      - fqdn                    = null
      - id                      = "/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.Network/publicIPAddresses/pip-cluster-prod"
      - idle_timeout_in_minutes = 4
      - ip_address              = "51.124.221.158"
      - ip_tags                 = {}
      - ip_version              = "IPv4"
      - location                = "westeurope"
      - name                    = "pip-cluster-prod"
      - public_ip_prefix_id     = null
      - resource_group_name     = "rg-cluster"
      - reverse_fqdn            = null
      - sku                     = "Standard"
      - sku_tier                = "Regional"
      - tags                    = {}
      - timeouts                = null
      - zones                   = []
    } -> null

```

</details>

*Pushed by: @ElettroAle, Action: `pull_request`*